Repository: annihilatorrrr/ebook-converter-bot
Catalog: ebook_converter_bot/data/locales/*/LC_MESSAGES/ebook_converter_bot.po
Languages: ar, tr

source: Language
ar: اللغة
tr: Dil

source: **Available bot preferences:**
ar: **الإعدادات المتوفرة للبوت:**
tr: **Kullanılabilir bot tercihleri:**

source: Back
ar: رجوع
tr: Geri

source: **Select Bot language**
ar: **اختر لغة البوت**
tr: **Bot dilini seçiniz**

source: **Language has been set to**: {} ({})
ar: **غُيرت لغة البوت إلى**: {} ({})
tr: **Seçilen dil**: {} ({})

source: Force RTL
ar: إجبار جهة النص من اليمين لليسار
tr: RTL'ye zorla

source: Fix EPUB before converting
ar: إصلاح الكتاب قبل التحويل
tr: Dönüştürmeden önce EPUB'u düzelt

source: Flatten EPUB TOC
ar: تسطيح فهرس الكتاب
tr: EPUB içindekiler tablosunu düzleştir

source: Smarten punctuation
ar: تحسين علامات الترقيم
tr: Noktalama işaretlerini iyileştir

source: Text justification
ar: محاذاة النص
tr: Metin hizalaması

source: Remove paragraph spacing
ar: إزالة تباعد الفقرات
tr: Paragraf boşluklarını kaldır

source: Original
ar: أصلي
tr: Özgün

source: Left
ar: يسار
tr: Sola

source: Justify
ar: ضبط
tr: İki yana yasla

source: DOCX page size
ar: حجم صفحة DOCX
tr: DOCX sayfa boyutu

source: DOCX: disable generated TOC
ar: DOCX: تعطيل إنشاء جدول المحتويات
tr: DOCX: oluşturulan içindekileri devre dışı bırak

source: EPUB version
ar: إصدار EPUB
tr: EPUB sürümü

source: EPUB: inline TOC
ar: EPUB: جدول محتويات مضمّن
tr: EPUB: satır içi içindekiler

source: Remove EPUB background
ar: إزالة خلفية EPUB
tr: EPUB arka planını kaldır

source: PDF paper size
ar: حجم ورق PDF
tr: PDF kağıt boyutu

source: PDF: page numbers
ar: PDF: أرقام الصفحات
tr: PDF: sayfa numaraları

source: KFX doc type
ar: نوع مستند KFX
tr: KFX belge türü

source: KFX pages
ar: صفحات KFX
tr: KFX sayfaları

source: Default
ar: افتراضي
tr: Varsayılan

source: Letter
ar: ليتر

source: None
ar: بدون
tr: Yok

source: Auto
ar: تلقائي
tr: Otomatik

source: Reset options
ar: إعادة ضبط الخيارات
tr: Seçenekleri sıfırla

source: Back to formats
ar: العودة إلى الصيغ
tr: Biçimlere geri dön

source: Cancel
ar: إلغاء
tr: İptal

source: Text justification: {}
ar: محاذاة النص: {}
tr: Metin hizalaması: {}

source: DOCX page size: {}
ar: حجم صفحة DOCX: {}
tr: DOCX sayfa boyutu: {}

source: EPUB version: {}
ar: إصدار EPUB: {}
tr: EPUB sürümü: {}

source: PDF paper size: {}
ar: حجم ورق PDF: {}
tr: PDF kağıt boyutu: {}

source: KFX doc type: EBOK
ar: نوع مستند KFX: EBOK
tr: KFX belge türü: EBOK

source: KFX pages: Auto
ar: صفحات KFX: تلقائي
tr: KFX sayfaları: Otomatik

source: Conversion options:
ar: خيارات التحويل:
tr: Dönüştürme seçenekleri:

source: Select the format you want to convert to:
ar: اختر الصيغة التي تود التحويل إليها:
tr: Dönüştürmek istediğiniz türü seçiniz:

source: Options ⚙️
ar: الخيارات ⚙️
tr: Seçenekler ⚙️

source: This conversion request expired. Please send the file again.
ar: انتهت صلاحية طلب التحويل هذا. يرجى إرسال الملف مرة أخرى.
tr: Bu dönüştürme isteğinin süresi doldu. Lütfen dosyayı tekrar gönderin.

source: The source file is no longer available. Please send it again.
ar: الملف المصدر لم يعد متاحًا. يرجى إرساله مرة أخرى.
tr: Kaynak dosya artık kullanılamıyor. Lütfen tekrar gönderin.

source: Reply to a supported file to convert it.
ar: رد على ملف مدعوم لتحويله.
tr: Dönüştürmek için desteklenen bir dosyayı yanıtlayın.

source: The file you sent is not a supported type!
ar: نوع الملف الذي أرسلته غير مدعوم!
tr: Gönderdiğiniz dosya türü desteklenmemektedir!

source: Files larger than 25 MB are not supported!
ar: الملفات التي حجمها أكبر من 25 ميجابايت ليست مدعومة!
tr: 25 MB üzerindeki dosyalar desteklenmemektedir!

source: Downloading the file...
ar: جاري تحميل الملف...
tr: Dosya indiriliyor...

source: Failed to download the file. Please send it again.
ar: فشل تنزيل الملف. يرجى إرساله مرة أخرى.
tr: Dosya indirilemedi. Lütfen tekrar gönderin.

source: This option is not available in this context.
ar: هذا الخيار غير متاح في هذا السياق.
tr: Bu seçenek bu bağlamda kullanılamaz.

source: Conversion request canceled.
ar: ألغى طلب التحويل.
tr: Dönüştürme isteği iptal edildi.

source: Converting the file to {}...
ar: جاري تحويل الملف إلى {}...
tr: Dosya {} türüne dönüştürülüyor...

source: Converted to RTL successfully!
ar: تم التحويل إلى إتجاه من اليمين إلى اليسار بنجاح!
tr: RTL'ye başarıyla dönüştürüldü!

source: Done! Uploading the converted file...
ar: اكتمل التحويل! جاري رفع الملف المحول...
tr: İşlem tamamlandı! Dönüştürülen dosya yükleniyor...

source: Failed to convert the file (`{}`) to {} :(
ar: فشل تحويل الملف (`{}`) إلى {} :(
tr: (`{}`) dosyası {} dosyasına dönüştürülürken hata oluştu :(

source: Restarting, please wait...
ar: يٌعاد تشغيل البوت الآن، من فضلك انتظر...
tr: Yeniden başlatılıyor, lütfen bekleyin...

source: Hello {}! This bot converts e-books between formats, for example from EPUB to KFX. It currently supports {} input formats and {} output formats. Send me a supported file now and I'll show you the available conversion options. The bot is open source, you can find the source code [here](https://github.com/yshalsager/ebook-converter-bot). Developed by: [yshalsager](https://t.me/yshalsager/).
ar: مرحبًا {}! هذا البوت يحوّل الكتب الإلكترونية بين الصيغ، مثل التحويل من EPUB إلى KFX. يدعم حاليًا {} صيغة إدخال و{} صيغة إخراج. أرسل الآن ملفًا مدعومًا وسأعرض لك خيارات التحويل المتاحة. هذا البوت مفتوح المصدر، يمكنك العثور على الشيفرة المصدرية [هنا](https://github.com/yshalsager/ebook-converter-bot). طُوّر بواسطة: [yshalsager](https://t.me/yshalsager/).
tr: Merhaba {}! Bu bot e-kitapları biçimler arasında dönüştürür, örneğin EPUB'dan KFX'e. Şu anda {} giriş biçimini ve {} çıkış biçimini destekliyor. Bana şimdi desteklenen bir dosya gönderin, mevcut dönüştürme seçeneklerini göstereyim. Bu bot açık kaynaklıdır. Kaynağı [burada](https://github.com/yshalsager/ebook-converter-bot) bulabilirsiniz. Geliştiren: [yshalsager](https://t.me/yshalsager/).

source: **Bot Usage:** Forward any supported file to the bot and choose the required format to convert to, and in few seconds the bot will reply you with the converted file. The bot works in groups too. Reply with /convert to any file then do the same steps as in private. You can change the preferences of the bot such as language using /settings or /preferences commands.
ar: **كيفية استخدام البوت:** لاستخدام البوت ما عليك سوى ارسال الملف المراد تحويله إلى البوت وسيطلب منك اختيار الصيغة المحول لها ثم سيرسل الملف المحول. ويمكن أيضا استخدام البوت في المجموعات بالرد على أي ملف بالأمر /convert وعمل نفس الخطوات كما بالرسائل الخاصة كما يمكن تغيير إعدادات البوت مثل اللغة باستخدام الأوامر /settings أو /preferences.
tr: **Bot kullanımı:** Desteklenen herhangi bir türdeki dosyayı bota iletin ve ardındandönüştürülecek dosya türünü seçin. Bot, birkaç saniye içerisinde dönüştürülmüş dosya ile size geri dönüş yapacaktır. Bot, gruplarda da çalışmaktadır. Dönüştürmek istediğiniz dosyanın bulunduğu iletiyi alıntılayarak /convert iletisini girin ve sonrasında özel sohbette uyguladığınız adımların aynısını uygulayın. Botun dil vb. ayarlarını değiştirmek için /settings ya da /preferences emirlerini kullanabilirsiniz.

source: Broadcasting completed! Message was sent to {} chats
ar: اكتمل النشر! أرسلت الرسالة إلى {} محادثة
tr: Yayın tamamlandı! Mesaj {} sohbete gönderildi

source: Failed to broadcast to {} chats, most likely because bot has been stopped or kicked out.
ar: فشل الإرسال إلى {} محادثات، غالبا بسبب أن البوت طرد أو أوقف.
tr: {} sohbete yayın gönderilemedi, büyük olasılıkla bot durduruldu veya gruptan atıldı.
